; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v2)
             (pred_6 ?v11 ?v10)
             (pred_4 ?v4 ?v10)
             (pred_9 ?v5 ?v4 )
	     (pred_3 ?v4)
             (pred_5 ?v8)
             (pred_10 ?v11)
             (pred_12 ?v10)
             (pred_7 ?v4)
             (pred_8 ?v11)
             (pred_2 ?v4)
             (pred_1 ))



(:action op_5
:parameters (?v9 ?v3 ?v13 ?v1)
:precondition (and (pred_5 ?v9) (pred_5 ?v3) (pred_10 ?v13) (pred_12 ?v1)
          (pred_11 ?v9 ?v3) (pred_6 ?v13 ?v1)
                   (pred_4 ?v3 ?v1) (pred_3 ?v9) 
                   (pred_7 ?v3) (pred_8 ?v13))
:effect (and  (pred_2 ?v3) (not (pred_7 ?v3))))


(:action op_3
:parameters (?v9 ?v12)
:precondition (and (pred_5 ?v9) (pred_5 ?v12)
               (pred_3 ?v9) (pred_11 ?v9 ?v12) (pred_2 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v9))))

(:action op_1
:parameters (?v9 ?v13)
:precondition (and (pred_5 ?v9) (pred_10 ?v13) 
                  (pred_3 ?v9) (pred_9 ?v13 ?v9) (pred_1 ))
:effect (and (pred_8 ?v13)
   (not (pred_9 ?v13 ?v9)) (not (pred_1 ))))


(:action op_2
:parameters (?v9 ?v6 ?v7)
:precondition (and (pred_5 ?v9) (pred_10 ?v6) (pred_10 ?v7)
                  (pred_3 ?v9) (pred_8 ?v7) (pred_9 ?v6 ?v9))
:effect (and (pred_8 ?v6) (pred_9 ?v7 ?v9)
        (not (pred_8 ?v7)) (not (pred_9 ?v6 ?v9))))

(:action op_4
:parameters (?v9 ?v13)
:precondition (and (pred_5 ?v9) (pred_10 ?v13) 
                  (pred_3 ?v9) (pred_8 ?v13))
:effect (and (pred_1 ) (pred_9 ?v13 ?v9) (not (pred_8 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_05 obj_13 obj_26 obj_02 obj_29 obj_17 obj_15 obj_24 obj_22 obj_08 obj_04 obj_06 obj_25 obj_16 obj_18 obj_23 obj_12 obj_14 obj_30 obj_03 obj_09 obj_10 obj_07 obj_01
    obj_28 obj_20
    obj_19 obj_21 obj_11
    )

    (:init
       (pred_1)

       (pred_5 obj_27)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_26)
       (pred_5 obj_02)
       (pred_5 obj_29)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_24)
       (pred_5 obj_22)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_25)
       (pred_5 obj_16)
       (pred_5 obj_18)
       (pred_5 obj_23)
       (pred_5 obj_12)
       (pred_5 obj_14)
       (pred_5 obj_30)
       (pred_5 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_12 obj_28)
       (pred_12 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_21)
       (pred_10 obj_11)

       (pred_11 obj_27 obj_29)
       (pred_11 obj_27 obj_05)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_05 obj_27)
       (pred_11 obj_13 obj_15)
       (pred_11 obj_13 obj_26)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_26 obj_24)
       (pred_11 obj_26 obj_02)
       (pred_11 obj_26 obj_13)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_02 obj_26)
       (pred_11 obj_29 obj_08)
       (pred_11 obj_29 obj_17)
       (pred_11 obj_29 obj_27)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_29)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_24 obj_25)
       (pred_11 obj_24 obj_22)
       (pred_11 obj_24 obj_26)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_22 obj_16)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_22 obj_24)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_08 obj_29)
       (pred_11 obj_04 obj_23)
       (pred_11 obj_04 obj_06)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_08)
       (pred_11 obj_06 obj_12)
       (pred_11 obj_06 obj_25)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_04)
       (pred_11 obj_25 obj_14)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_24)
       (pred_11 obj_25 obj_06)
       (pred_11 obj_16 obj_30)
       (pred_11 obj_16 obj_22)
       (pred_11 obj_16 obj_25)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_18 obj_23)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_23 obj_09)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_23 obj_04)
       (pred_11 obj_23 obj_18)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_12 obj_06)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_14 obj_30)
       (pred_11 obj_14 obj_25)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_30 obj_01)
       (pred_11 obj_30 obj_16)
       (pred_11 obj_30 obj_14)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_23)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_01 obj_07)
       (pred_7 obj_17)
       (pred_7 obj_27)
       (pred_7 obj_25)
       (pred_4  obj_17 obj_28)
       (pred_4  obj_27 obj_20)
       (pred_4  obj_25 obj_28)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_2 obj_26)
       (pred_2 obj_02)
       (pred_2 obj_29)
       (pred_2 obj_15)
       (pred_2 obj_24)
       (pred_2 obj_22)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_06)
       (pred_2 obj_16)
       (pred_2 obj_18)
       (pred_2 obj_23)
       (pred_2 obj_12)
       (pred_2 obj_14)
       (pred_2 obj_30)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_01)

       (pred_6  obj_19 obj_28)
       (pred_6  obj_21 obj_20)
       (pred_6  obj_11 obj_28)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_21 obj_05)
       (pred_9 obj_11 obj_08)
       (pred_3 obj_06)
    )

    (:goal (and
       (pred_9 obj_19 obj_12)
    ))
(:constraints
  (always (not (pred_3 obj_23)))
)
)

; plan
1. (op_3 obj_06 obj_12)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_12)
   goals met: 0 of 1
2. (op_3 obj_12 obj_10)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_10)
   goals met: 0 of 1
3. (op_3 obj_10 obj_09)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_09)
   goals met: 0 of 1
4. (op_1 obj_09 obj_19)
   deleted: (pred_9 obj_19 obj_09) (pred_1)
   added: (pred_8 obj_19)
   goals met: 0 of 1
5. (op_3 obj_09 obj_10)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_10)
   goals met: 0 of 1
6. (op_3 obj_10 obj_12)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_12)
   goals met: 0 of 1
7. (op_4 obj_12 obj_19)
   deleted: (pred_8 obj_19)
   added: (pred_1) (pred_9 obj_19 obj_12)
   goals met: 1 of 1
